# Rebar Shape Terminations Data Get Document Method

Source: https://www.revitapidocs.com/2026/1fedcf23-e167-36e1-4a57-a591b52d3536.htm

---

| Rebar Shape Terminations Data Get Document Method |
| --- |

Gets the document containing the end treatment ids.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public Document GetDocument()
```

```
Public Function GetDocument As Document
```

```
public:
Document^ GetDocument()
```

```
member GetDocument : unit -> Document
```

#### Return Value

Document
Returns the document containing the end treatment ids. See Also

#### Reference

RebarShapeTerminationsData Class Autodesk.Revit.DB.Structure Namespace